app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG', 'PG-13', 'R')  ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE 1=0  ORDER BY release_date
---
    def index
        @all_ratings = Movie.all_ratings
        if (params[:ratings] || session[:ratings]).nil?
            @ratings_to_show = @all_ratings
            redirect_to movies_path({:sort => params[:sort], :ratings => @ratings_to_show})
        else
            @ratings_to_show = (params[:ratings] || session[:ratings]).keys
            params[:ratings] = (params[:ratings] || session[:ratings])
            session[:ratings] = (params[:ratings] || session[:ratings])
        end

        if (params[:sort] || session[:sort]) == 'title'
            if params[:sort] != session[:sort]
                session[:sort] = 'title'
            end
            @title_header = 'hilite bg-warning'
            @movies = Movie.with_ratings(@ratings_to_show).order('title')
        elsif (params[:sort] || session[:sort]) == 'release_date'
            if params[:sort] != session[:sort]
                session[:sort] = 'ratings_to_show'
            end
            @release_date_header = 'hilite bg-warning'
            @movies = Movie.with_ratings(@ratings_to_show).order('release_date')